HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxDma_bf.h
/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.SHCT */
#define IFX_DMA_BLK_ME_ADICR_SHCT_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.SHCT */
#define IFX_DMA_BLK_ME_ADICR_SHCT_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.SMF */
#define IFX_DMA_BLK_ME_ADICR_SMF_LEN (3)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.SMF */
#define IFX_DMA_BLK_ME_ADICR_SMF_MSK (0x7)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.SMF */
#define IFX_DMA_BLK_ME_ADICR_SMF_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.STAMP */
#define IFX_DMA_BLK_ME_ADICR_STAMP_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.STAMP */
#define IFX_DMA_BLK_ME_ADICR_STAMP_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.STAMP */
#define IFX_DMA_BLK_ME_ADICR_STAMP_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.WRPDE */
#define IFX_DMA_BLK_ME_ADICR_WRPDE_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.WRPDE */
#define IFX_DMA_BLK_ME_ADICR_WRPDE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.WRPDE */
#define IFX_DMA_BLK_ME_ADICR_WRPDE_OFF (25)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.WRPSE */
#define IFX_DMA_BLK_ME_ADICR_WRPSE_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.WRPSE */
#define IFX_DMA_BLK_ME_ADICR_WRPSE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.WRPSE */
#define IFX_DMA_BLK_ME_ADICR_WRPSE_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.BLKM */
#define IFX_DMA_BLK_ME_CHCR_BLKM_LEN (3)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.BLKM */
#define IFX_DMA_BLK_ME_CHCR_BLKM_MSK (0x7)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.BLKM */
#define IFX_DMA_BLK_ME_CHCR_BLKM_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.CHDW */
#define IFX_DMA_BLK_ME_CHCR_CHDW_LEN (3)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.CHDW */
#define IFX_DMA_BLK_ME_CHCR_CHDW_MSK (0x7)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.CHDW */
#define IFX_DMA_BLK_ME_CHCR_CHDW_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.CHMODE */
#define IFX_DMA_BLK_ME_CHCR_CHMODE_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.CHMODE */
#define IFX_DMA_BLK_ME_CHCR_CHMODE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.CHMODE */
#define IFX_DMA_BLK_ME_CHCR_CHMODE_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.DMAPRIO */
#define IFX_DMA_BLK_ME_CHCR_DMAPRIO_LEN (2)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.DMAPRIO */
#define IFX_DMA_BLK_ME_CHCR_DMAPRIO_MSK (0x3)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.DMAPRIO */
#define IFX_DMA_BLK_ME_CHCR_DMAPRIO_OFF (30)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.PATSEL */
#define IFX_DMA_BLK_ME_CHCR_PATSEL_LEN (3)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.PATSEL */
#define IFX_DMA_BLK_ME_CHCR_PATSEL_MSK (0x7)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.PATSEL */
#define IFX_DMA_BLK_ME_CHCR_PATSEL_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.PRSEL */
#define IFX_DMA_BLK_ME_CHCR_PRSEL_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.PRSEL */
#define IFX_DMA_BLK_ME_CHCR_PRSEL_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.PRSEL */
#define IFX_DMA_BLK_ME_CHCR_PRSEL_OFF (28)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.RROAT */
#define IFX_DMA_BLK_ME_CHCR_RROAT_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.RROAT */
#define IFX_DMA_BLK_ME_CHCR_RROAT_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.RROAT */
#define IFX_DMA_BLK_ME_CHCR_RROAT_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHCR_Bits.TREL */
#define IFX_DMA_BLK_ME_CHCR_TREL_LEN (14)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHCR_Bits.TREL */
#define IFX_DMA_BLK_ME_CHCR_TREL_MSK (0x3fff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHCR_Bits.TREL */
#define IFX_DMA_BLK_ME_CHCR_TREL_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_BLK_ME_CHSR_BUFFER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_BLK_ME_CHSR_BUFFER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.BUFFER */
#define IFX_DMA_BLK_ME_CHSR_BUFFER_OFF (22)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.FROZEN */
#define IFX_DMA_BLK_ME_CHSR_FROZEN_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.FROZEN */
#define IFX_DMA_BLK_ME_CHSR_FROZEN_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.FROZEN */
#define IFX_DMA_BLK_ME_CHSR_FROZEN_OFF (23)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.ICH */
#define IFX_DMA_BLK_ME_CHSR_ICH_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.ICH */
#define IFX_DMA_BLK_ME_CHSR_ICH_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.ICH */
#define IFX_DMA_BLK_ME_CHSR_ICH_OFF (18)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.IPM */
#define IFX_DMA_BLK_ME_CHSR_IPM_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.IPM */
#define IFX_DMA_BLK_ME_CHSR_IPM_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.IPM */
#define IFX_DMA_BLK_ME_CHSR_IPM_OFF (19)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.LXO */
#define IFX_DMA_BLK_ME_CHSR_LXO_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.LXO */
#define IFX_DMA_BLK_ME_CHSR_LXO_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.LXO */
#define IFX_DMA_BLK_ME_CHSR_LXO_OFF (15)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_ME_CHSR_TCOUNT_LEN (14)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_ME_CHSR_TCOUNT_MSK (0x3fff)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.TCOUNT */
#define IFX_DMA_BLK_ME_CHSR_TCOUNT_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_ME_CHSR_WRPD_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_ME_CHSR_WRPD_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_CHSR_Bits.WRPD */
#define IFX_DMA_BLK_ME_CHSR_WRPD_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_ME_CHSR_Bits.WRPS */
#define IFX_DMA_BLK_ME_CHSR_WRPS_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_CHSR_Bits.WRPS */
#define IFX_DMA_BLK_ME_CHSR_WRPS_MSK (0x1)

